# FabricWireType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricWireType Property
ParameterTypeId Class See Also
---
"Wire type": The wire type assigned
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricWireType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricWireType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricWireType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace